/*
1. 分析如下程序的输出结果
  ```C
  char c = -56 >> 30;
  printf("%d\n", c);
  printf("%u\n", c);
  ```
*/

//-56（signed int）在内存中以补码的形式存储 ，即11111111 11111111 11111111 11001000
//右移30位后变为11111111 11111111 11111111 11111111，即-1
//转为char类型后，高位抛弃，低位保留，为11111111
// 格式化输出为有符号整数时，有符号char，高位补符号位，全1，输出-1
// 格式化输出为无符号整数时，全1输出为4294967295
// 
// 在逻辑上，-56类型为有符号整型，数学值为-56，右移操作会进行算术右移，高位补符号位1



/*
2. 分析如下程序的输出结果

   ```c
   char c = -56u >> 30;
   printf("%d\n", c);
   printf("%u\n", c);
   ```
*/

//-56u（unsigned int）并不是负的无符号数，因为unsigned类型不能表示负数。56u在内存中以原码的形式存储
//即00000000 00000000 00000000 11001000
//取负号相当于对该数进行模2^32的减法运算，即2^32-56
//二进制表示为11111111 11111111 11111111 11001000，与-56的补码表示相同
//右移30位后变为00000000 00000000 00000000 00000011，无符号高位补0，即3
//格式化输出为有符号整数时，输出3
//格式化输出为无符号整数时，输出3
//
//在逻辑上，-56u类型为无符号整型，数学值为2^32-56，右移操作会进行逻辑右移，高位补0



/**
 * @brief 水仙花数
 * 
 * 从键盘输入一个整数，判断该数是否为水仙花数
 * 水仙花数是一个三位数，并且个位数的立方 + 十位立方 + 百位立方 == 数本身
 * 
 */

//  #include <stdio.h>
//  int main()
//  {
//      int num;
//      for(num=100;num<=999;num++)
//      {
//          int bai,shi,ge;
//          bai=num/100;
//          shi=(num-bai*100)/10;
//          ge=num%10;
//          if(num==(bai*bai*bai+shi*shi*shi+ge*ge*ge))
//          {
//              printf("%d\n",num);
//          }
//      }
//      return 0;
//  }

//输出结果为：
//153
//370
//371
//407



/**
 * @brief 一数三平方
 * 
 * 输入一个六位数，判断它是否为一数三平方
 * 一数三平方：该数本身是一个数的平方，其高三位和低三位分别是一个整数的平方
 */

// #include <stdio.h>
// int main()
// {
//     int num;
//     for (num = 100000; num <= 999999; num++)
//     {
//         for (int i = 315; i * i <= num; i++)
//         {
//             if (i * i == num)
//             {
//                 int low, high;
//                 low = num % 1000;
//                 high = num / 1000;
//                 for (int i = 1; i * i <= low; i++)
//                 {
//                     if (i * i == low)
//                     {
//                         for (int j = 1; j * j <= high; j++)
//                         {
//                             if (j * j == high)
//                             {
//                                 printf("%d\n", num);
//                             }
//                         }
//                     }
//                 }
//             }
//             continue;
//         }
//     }
// }

//输出结果为：
// 144400
// 225625
// 256036
// 324900
// 576081


/**
 * @brief 逆序打印数字及位数
 * 给一个不多于5位的正整数，要求：求出它是一个几位数，分别输出每一位数字，最终按逆序输出各位数字
 * 
 */
// #include <stdio.h>
// int main()
// {
//     int num;
//     scanf("%d", &num);
//     if(num<10)
//     {
//         printf("1\n");
//         printf("%d\n",num);
//     }
//     else if(num<100)
//     {
//         printf("2\n");
//         printf("%d%d\n",num%10,num/10);
//     }
//     else if(num<1000)
//     {
//         printf("3\n");
//         printf("%d%d%d\n",num%10,(num/10)%10,num/100);
//     }
//     else if(num<10000)
//     {
//         printf("4\n");
//         printf("%d%d%d%d\n",num%10,(num/10)%10,(num/100)%10,num/1000);
//     }
//     else if(num<=99999)
//     {
//         printf("5\n");
//         printf("%d%d%d%d%d\n",num%10,(num/10)%10,(num/100)%10,(num/1000)%10,num/10000);
//     }
//     return 0;
// }




/*
计算运输公司的计费，某运输公司的收费按照用户运送货物的路程进行计费，路程（s）越远，每公里运费越低，收费标准如下

| 路程（km）       | 运费                      |
| ---------------- | ------------------------ |
| s < 250          | 没有折扣（每km 1元计费）   |
| 250 <= s < 500   | 2%折扣                   |
| 500 <= s < 1000  | 5%折扣                   |
| 1000 <= s < 2000 | 8%折扣                   |
| 2000 <= s < 3000 | 10%折扣                  |
| 3000 <= s        | 15%折扣                  |
*/

// #include <stdio.h>
// int main()
// {
//     int s;
//     double cost;
//     scanf("%d", &s);
//     if (s < 250)
//     {
//         cost = s * 1.0;
//         printf("%.2f\n", cost);
//     }
//     else if (s >= 250 && s < 500)
//     {
//         cost = s * 1.0 * (1 - 0.02);
//         printf("%.2f\n", cost);
//     }
//     else if (s >= 500 && s < 1000)
//     {
//         cost = s * 1.0 * (1 - 0.05);
//         printf("%.2f\n", cost);
//     }
//     else if (s >= 1000 && s < 2000)
//     {
//         cost = s * 1.0 * (1 - 0.08);
//         printf("%.2f\n", cost);
//     }
//     else if (s >= 2000 && s < 3000)
//     {
//         cost = s * 1.0 * (1 - 0.10);
//         printf("%.2f\n", cost);
//     }
//     else
//     {
//         cost = s * 1.0 * (1 - 0.15);
//         printf("%.2f\n", cost);
//     }
// }





/*
计算每月工资应缴个人所得税及税后工资
起征点： 5000元， 超出5000元部分按照下面方式进行纳税
| 超出部分        | 税率 |
| --------------- | ---- |
| 1 ~ 3000元      | 3%   |
| 3001 ~ 12000元  | 10%  |
| 12001 ~ 25000元 | 20%  |
| 25001 ~ 35000元 | 25%  |
| 35001 ~ 55000元 | 30%  |
| 55001 ~ 80000元 | 35%  |
| 80001元以上     | 45%  |
*/

// #include <stdio.h>
// int main()
// {
//     double salary;
//     scanf("%lf", &salary);
//     double tax;
//     if (salary <= 5000)
//     {
//         tax = 0;
//     }
//     else if (salary > 5000 && salary <= 8000)
//     {
//         tax = (salary - 5000) * 0.03;
//     }
//     else if (salary > 8000 && salary <= 17000)
//     {
//         tax = (salary - 5000) * 0.10;
//     }
//     else if (salary > 17000 && salary <= 30000)
//     {
//         tax = (salary - 5000) * 0.20;
//     }
//     else if (salary > 30000 && salary <= 40000)
//     {
//         tax = (salary - 5000) * 0.25;
//     }
//     else if (salary > 40000 && salary <= 60000)
//     {
//         tax = (salary - 5000) * 0.30;
//     }
//     else if (salary > 60000 && salary <= 85000)
//     {
//         tax = (salary - 5000) * 0.35;
//     }
//     else
//     {
//         tax = (salary - 5000) * 0.45;
//     }  
//     printf("tax: %.2f\n", tax);
//     printf("after tax: %.2f\n", salary - tax);
// }




